_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 44, 44, 64)        1600
_________________________________________________________________
batch_normalization_1 (Batch (None, 44, 44, 64)        256
_________________________________________________________________
activation_1 (Activation)    (None, 44, 44, 64)        0
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 22, 22, 64)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 22, 22, 64)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 18, 18, 32)        51200
_________________________________________________________________
batch_normalization_2 (Batch (None, 18, 18, 32)        128
_________________________________________________________________
activation_2 (Activation)    (None, 18, 18, 32)        0
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 9, 9, 32)          0
_________________________________________________________________
dropout_2 (Dropout)          (None, 9, 9, 32)          0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 5, 5, 32)          25600
_________________________________________________________________
batch_normalization_3 (Batch (None, 5, 5, 32)          128
_________________________________________________________________
activation_3 (Activation)    (None, 5, 5, 32)          0
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 2, 2, 32)          0
_________________________________________________________________
dropout_3 (Dropout)          (None, 2, 2, 32)          0
_________________________________________________________________
flatten_1 (Flatten)          (None, 128)               0
_________________________________________________________________
dense_1 (Dense)              (None, 7)                 903
=================================================================
Total params: 79,815
Trainable params: 79,559
Non-trainable params: 256
_________________________________________________________________